In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

## Series

In [2]:
arr = np.array(["Mon","Tues","Wed","Thus","Fri","Sat","Sun"])

In [3]:
s1 = pd.Series(arr, name="Weekdays")
s1

0     Mon
1    Tues
2     Wed
3    Thus
4     Fri
5     Sat
6     Sun
Name: Weekdays, dtype: object

In [4]:
s1.name

'Weekdays'

In [5]:
s2 =pd.Series([2,5,7,4], name = "Number_list")
s2

0    2
1    5
2    7
3    4
Name: Number_list, dtype: int64

In [6]:
s3 = pd.Series((1,2,3,4,5))
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# s4 = pd.Series(p.random.randint(1,26,24).reshape(6,4), name="Random_Name"
# we cannot create series more than more 1 dimenshion

In [8]:
s3.dtype

dtype('int64')

In [9]:
s3.mean()

3.0

In [10]:
s2.mean()

4.5

In [11]:
s3.std()

1.5811388300841898

In [12]:
# creating dictionary
d = {
    "Std_Names":["Chandu", "Nandu", "Bandu"],
    "Marks": [67,59,46]
}
d

{'Std_Names': ['Chandu', 'Nandu', 'Bandu'], 'Marks': [67, 59, 46]}

In [13]:
# creating dataframe
df = pd.DataFrame(d)
df

  Std_Names  Marks
0    Chandu     67
1     Nandu     59
2     Bandu     46

In [14]:
arr2 = np.random.randint(35, 99, 24).reshape(6,4)
arr2

array([[63, 85, 39, 44],
       [81, 94, 53, 77],
       [51, 94, 88, 98],
       [37, 88, 94, 55],
       [65, 77, 85, 35],
       [83, 96, 98, 42]])

In [15]:
df2 = pd.DataFrame(arr2)
df2

    0   1   2   3
0  63  85  39  44
1  81  94  53  77
2  51  94  88  98
3  37  88  94  55
4  65  77  85  35
5  83  96  98  42

In [16]:
df3 = pd.DataFrame(arr2, columns=["Math", "English", "Physics", "Sport"])
df3

   Math  English  Physics  Sport
0    63       85       39     44
1    81       94       53     77
2    51       94       88     98
3    37       88       94     55
4    65       77       85     35
5    83       96       98     42

In [17]:
df3["Std_Name"] =  ["Sachin", "Rohit", "Virat", "Shubhman", "Ravindra", "Rinku"]
df3

   Math  English  Physics  Sport  Std_Name
0    63       85       39     44    Sachin
1    81       94       53     77     Rohit
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra
5    83       96       98     42     Rinku

In [18]:
# to see few data from the above data
# to return the top 5 rows of dataframe, we can return as many rows by
# giving number in head()
df3.head()

   Math  English  Physics  Sport  Std_Name
0    63       85       39     44    Sachin
1    81       94       53     77     Rohit
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra

In [19]:
df3.head(3)

   Math  English  Physics  Sport Std_Name
0    63       85       39     44   Sachin
1    81       94       53     77    Rohit
2    51       94       88     98    Virat

In [20]:
# retuns 5 rows from bottm
df3.tail()

   Math  English  Physics  Sport  Std_Name
1    81       94       53     77     Rohit
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra
5    83       96       98     42     Rinku

In [21]:
# returns 3 rows from the bottom
df3.tail(3)

   Math  English  Physics  Sport  Std_Name
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra
5    83       96       98     42     Rinku

In [22]:
# retuns 3 and 4 number of row ( do not include the end range)
df3.iloc[3:5]

   Math  English  Physics  Sport  Std_Name
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra

In [23]:
# returns 2,3 and 4 rows (also include end range)
df3.loc[2:4]

   Math  English  Physics  Sport  Std_Name
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra

In [24]:
type(df3["Math"])

pandas.core.series.Series

In [25]:
df3

   Math  English  Physics  Sport  Std_Name
0    63       85       39     44    Sachin
1    81       94       53     77     Rohit
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra
5    83       96       98     42     Rinku

In [26]:
# returns the row mentioned in the square brackets
df3.iloc[1]

Math           81
English        94
Physics        53
Sport          77
Std_Name    Rohit
Name: 1, dtype: object

In [27]:
df2

    0   1   2   3
0  63  85  39  44
1  81  94  53  77
2  51  94  88  98
3  37  88  94  55
4  65  77  85  35
5  83  96  98  42

In [28]:
df2.iloc[0].mean()

57.75

In [29]:
df3[["Math", "English"]]

   Math  English
0    63       85
1    81       94
2    51       94
3    37       88
4    65       77
5    83       96

In [30]:
# df3.drop("Std_Name", axis=1, inplace=True)

In [31]:
df3

   Math  English  Physics  Sport  Std_Name
0    63       85       39     44    Sachin
1    81       94       53     77     Rohit
2    51       94       88     98     Virat
3    37       88       94     55  Shubhman
4    65       77       85     35  Ravindra
5    83       96       98     42     Rinku

In [32]:
# getting file from the location from which this jupyter notebook is not started
# excel file
# df6 = pd.read_excel(r"C:\Users\Admin\Downloads\SampleSuperstore.xlsx")
# df6.head(3)

In [33]:
# getting file from the location from which this jupyter notebook is started
# excel file
# df5 = pd.read_excel("SampleSuperstore.xlsx")
# df5.head(2)